Feature: Mark feature
   Отговаря за правилно въвеждане на оценки на ученици
   
Scenario: Въвеждане на правилна оценкa и правилен ученически номер
    Given потребителя отваря страницата за въвеждане на оценки
    And натиска върху бутона за въвеждане на оценка
    And визуализира се форма за въвеждане на оценка
    When въведе валидна оценка 
    And въведе валиден ученически номер
    And натисне бутона за въвеждане на оценка
    Then вижда съобщение с текст "Вие успешно въведохте оценка!"
  
Scenario: Въвеждане на правилна оценкa и грешен ученически номер
    Given потребителя отваря страницата за въвеждане на оценки
    And натиска върху бутона за въвеждане на оценка
    And визуализира се форма за въвеждане на оценка
    When въведе валидна оценка 
    And въведе грешен ученически номер
    And натисне бутона за въвеждане на оценка
    Then вижда съобщение с текст "Моля въведете валидни данни!"

Scenario: Въвеждане на грешна оценкa и валиден ученически номер
    Given потребителя отваря страницата за въвеждане на оценки
    And натиска върху бутона за въвеждане на оценка
    And визуализира се форма за въвеждане на оценка
    When въведе грешна оценка 
    And въведе валиден ученически номер
    And натисне бутона за въвеждане на оценка
    Then вижда съобщение с текст "Моля въведете валидни данни!"
    
Scenario: Въвеждане на грешна оценкa и грешен ученически номер
    Given потребителя отваря страницата за въвеждане на оценки
    And натиска върху бутона за въвеждане на оценка
    And визуализира се форма за въвеждане на оценка
    When въведе грешна оценка 
    And въведе грешен ученически номер
    And натисне бутона за въвеждане на оценка
    Then вижда съобщение с текст "Моля въведете валидни данни!"
    
Scenario: Потребителят не въвежда оценка и не въвежда ученически номер
    Given потребителя отваря страницата за въвеждане на оценки
    And натиска върху бутона за въвеждане на оценка
    And визуализира се форма за въвеждане на оценка
    When не въвежда оценка 
    And не въвежда ученически номер
    And натисне бутона за въвеждане на оценка
    Then вижда съобщение с текст "Моля въведете валидни данни!"

    

    
    